app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    authorize! :index, @user, :message => 'Not authorized as an administrator.'
    @users = User.all

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def show
    if ["edit","me"].include?(params[:id])
      @user = current_user
    else
      authorize! :invite, @user, :message => 'Not authorized as an administrator.'
      @user = User.find(params[:id])